{
	"article": {
		"header": {
			"title": "History of Hung Kuen",
			"byline": {
				"name": "Sifu Maurice Morrison",
				"url": "about/sifu-maurice-morrison",
				"image": "https://biggica-sites.s3.amazonaws.com/fongs-hung-ga/images/profiles/maurice-morrison-avatar.jpg"
			},
			"primary_asset": {
				"type": "image",
				"content": {
					"size": "small",
					"alignment": "left",
					"src": "https://biggica-sites.s3.amazonaws.com/fongs-hung-ga/articles/history-of-hung-kuen/tang-fong-village.jpg"
				}
			}
		},
		"body": {
			"items": [
				{
					"type": "paragraph",
					"content": {
						"text": "The Hung Ga system began in the Ching dynasty during the reign of Yung Jing (1723-1736 a.d.). Hung Ga was the number one style among five family styles of the south. These were:"
					}
				},
				{
					"type": "list",
					"content": {
						"list_type": "unordered",
						"items": [
							{
								"text": "Hung Ga: Founded by Hung Hei Guen"
							},
							{
								"text": "Lau Ga: Founded by Lau Sam Ngan"
							},
							{
								"text": "Choy Ga: Founded by Choy Gau Yee"
							},
							{
								"text": "Lei Ga: Founded by Lei Gum Lun"
							},
							{
								"text": "Mok Ga: Founded by Mok Ching Gui"
							}
						]
					}
				},
				{
					"type": "paragraph",
					"content": {
						"text": "Each of these systems is unique and possesses distinctive and special techniques. Originally, Hung Hei Guen’s surname was Jyu. His grandfather was an official of the Ming government and the family was well off. Hung was originally a tea merchant before becoming a student of master Jee Sim and graduating from the south Siu Lam temple. As a staunch supporter of the deposed Ming regime, he changed his surname from Jyu to Hung in honor of the first Ming emperor Jyu Hung Mo (1271-1368 a.d.). Hung would have referred to his martial arts as Siu Lam kung fu, but out of fear that the Siu Lam connection would get him and his followers in trouble, he called the art Hung Ga of Hung family kung fu to hide its true source. Later, his followers would continue this practice, in honor of their venerated master. After the burning of the Siu Lam temple in Fukien, he met and married Fong Wing Chun, a former student of Buddhist nun Ng Mui. Fong was knowledgeable in Crane style kung fu. He later moved to Fa city in Gwang Dung province and later died there at the advanced age of 90 years. His tomb is still located there. In addition, historical records at Fukien Chan Jau Fu Ji indicated that Hung Hei Guen killed someone there with a single punch. In addition to this as evidence of Hung’s existence, it also attests to the devastating power of Hung’s fist."
					}
				},
				{
					"type": "paragraph",
					"content": {
						"text": "Hung Kuen became known for two things:"
					}
				},
				{
					"type": "list",
					"content": {
						"list_type": "ordered",
						"items": [
							{
								"text": "The “thousand pound foundation” or horse stance."
							},
							{
								"text": "The “iron fist” and “iron arm” or fists and forearms continuously conditioned on sandbags and wooden posts."
							}
						]
					}
				},
				{
					"type": "paragraph",
					"content": {
						"text": "For example, when Hung Hei Guen sank into a horse stance, more than ten people with staffs were unable to move him. This is a difficult achievement, requiring 3-7 years practice. Some others occasionally say that Hung Kuen is slow. This is untrue. Like many systems, Hung Kuen emphasizes fast strikes. However, it believes that a firm root is the most indispensable feature of the training. It is that when people are mobile and flexible but do not have a solid foundation it is easy for them to lose. Thus, Hung Kuen is solid first, and mobile and flexible secondly."
					}
				}
			]
		}
	}	
}