{
	"items": [
		{
			"type": "paragraph",
			"content": {
				"text": "The lion dance is a traditional style of dance performed in Chinese culture and is usually an integral part of most Chinese Kung Fu schools. The lion dance typically consists of two performers, one in the head of the lion, and the other in the tail as they perform sequenced steps, movements and acrobatics to accompanying music on drums, cymbals and gongs from their classmates. The head is typically made of papier-mache, and the performers’ faces are rarely seen during the actual performance, giving illusion that the lion has come to life."
			}
		},
		{
			"type": "image",
			"content": {
				"size": "small",
				"alignment": "left",
				"src": "https://biggica-sites.s3.amazonaws.com/fongs-hung-ga/images/lion-dance/three-lions-02.jpg"
			}
		},
		{
			"type": "subheader",
			"content": {
				"text": "Why perform lion dances"
			}
		},
		{
			"type": "paragraph",
			"content": {
				"text": "Lion dances are mostly performed around the time of Chinese New Year, as a means of symbolizing the wishing of good fortune and celebration of the new year. However, lion dances serve many other purposes such as blessing a business with good fortune, sanctioning the grand-opening of a building, and celebratory events like the anniversary of an establishment, or even a birthday party."
			}
		},
		{
			"type": "subheader",
			"content": {
				"text": "Why we do it"
			}
		},
		{
			"type": "paragraph",
			"content": {
				"text": "Lion dancing at Fong’s Hung Ga is an experience that takes students to many different places and allows them to express an art form not commonly seen on a daily basis. Lion dance is also an intense physical workout that is integral to Hung Ga as it conditions and builds muscles gained by our students during their regular classroom training. It also further instills in our students the importance of proper stances as lion dancing utilizes each stance in the Hung Ga system and is dependent on the performer not only having knowledge of each stance, but also having trained enough to execute each movement without losing their balance or falling short on stamina."
			}
		}
	]
}